Обработки/Reports/_ОСВпоСчетамБУНПФ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.17">
	<Report>
		<Properties>
			<Name>_ОСВпоСчетамБУНПФ</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Период</Name>
					<Type>
						<v8:Type>v8:StandardPeriod</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СчетДоверительногоУправления</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СчетаДоверительногоУправления</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЕдиницаИзмерения</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>7</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Report>
</MetaDataObject>

Обработки/Reports/_ОСВпоСчетамБУНПФ/Ext/ObjectModule.bsl
// Интерфейс для регистрации обработки. Вызывается при добавлении обработки в справочник "ВнешниеОбработки"
//
// Возвращаемое значение (Структура):
//     Вид (Строка) - вид подключаемого объекта:
//         |- "ДополнительнаяОбработка"
//         |- "ДополнительныйОтчет"
//         |- "ЗаполнениеОбъекта"
//         |- "ПечатнаяФорма"
//
//     Назначение (массив строк) - имена объектов метаданных в формате <ИмяКлассаОбъектаМетаданного>.[*|<ИмяОбъектаМетаданных>]
//         Например, "Документ.СчетЗаказ" или "Справочник.*"
//
//     Наименование (строка) - краткая строка для идентификации обработки администратором (должна быть уникальна в пределах вида)
//
//     Версия (строка) - версия обработки в формате <старший номер>.<младший номер> (например "10.37")
//
//     Информация (Строка) - описание обработки
//
//     Команды (ТаблицаЗначений) - команды, поставляемые обработкой; одна строка таблицы соотвествует одной команде; колонки:
//         |- Представление (строка) - представление команды конечному пользователю
//         |- Идентификатор (строка) - идентификатор команды
//         |- Использование (строка) - варианты запуска обработки:
//         |      |- "ОткрытиеФормы"          - открыть форму обработки
//         |      |- "ВызовКлиентскогоМетода" - вызов клиентского экспортного метода из формы обработки
//         |      |- "ВызовСерверногоМетода"  - вызов серверного экспортного метода из модуля объекта обработки
//    	   |- ПоказыватьОповещение (Булево) - если Истина, требуется оказывать оповещение при начале и при окончании запуска обработки
//         |      Прим. Имеет смысл только при запуске обработки без открытия формы.
//	       |- Модификатор (Cтрока) - для печатных форм MXL, которые требуется отображать в форме ПечатьДокументов подсистемы
//                Печать требуется установить как "ПечатьMXL"
//
Функция СведенияОВнешнейОбработке() Экспорт
	
	РегистрационныеДанные = РаботаСДополнительнымиОтчетамиИОбработками.ЗаполнитьРегистрационныеДанные(
		Перечисления.ВидыДополнительныхОтчетовИОбработок.ДополнительныйОтчет,
		"Оборотно-сальдовая ведомость по счетам бухгалтерского учета НПФ",
		"0.27",
		"",
		Истина);
		
	// команды
	РегистрационныеДанные.Вставить("Команды", РаботаСДополнительнымиОтчетамиИОбработками.СоздатьТаблицуКоманд());
	
	Возврат РегистрационныеДанные;
	
КонецФункции

Процедура АвтоматическоеФормирование(НастройкиОтчета) Экспорт
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, НастройкиОтчета);
	
	Если НастройкиОтчета.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000000") Тогда
		ЭтотОбъект.ЕдиницаИзмерения = 1000000;
	ИначеЕсли НастройкиОтчета.ЕдиницаИзмерения = ПредопределенноеЗначение("Перечисление.ПорядкиОкругленияОтчетности.Окр1000") Тогда
		ЭтотОбъект.ЕдиницаИзмерения = 1000;
	Иначе
		ЭтотОбъект.ЕдиницаИзмерения = 1;
	КонецЕсли; 
	
	ЭтотОбъект.КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Вставить("СтруктураДанныхКонтактногоЛица", НастройкиОтчета.Подписант);
	
	ДокументРезультат = Новый ТабличныйДокумент;
	
	СкомпоноватьРезультат(ДокументРезультат);
	
	НастройкиОтчета.Вставить("Результат", ДокументРезультат);
	
КонецПроцедуры

Процедура ПриКомпоновкеРезультата(ДокументРезультат, ДанныеРасшифровки, СтандартнаяОбработка)
		
	// Фиксируем запуск процедуры
	ПараметрыВыполненияДляСбораСтатистики = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ПолучитьПараметрыВыполнения(ЭтотОбъект, "Период,Организация,СчетДоверительногоУправления,ЕдиницаИзмерения");
	Механизм = ЭтотОбъект.Метаданные().ПолноеИмя() + ".ПриКомпоновкеРезультата()";
	Сессия = РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьНовуюСессию(
		Механизм,
		ПараметрыВыполненияДляСбораСтатистики.Хранилище,
		ПараметрыВыполненияДляСбораСтатистики.Описание);
		
#Область Запрос

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Новый МенеджерВременныхТаблиц;
	Запрос.Текст = 
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	РеквизитыОрганизации.ПолноеНаименованиеПоУставу КАК НаименованияУК,
		|	СчетаДоверительногоУправления.НомерДоговора КАК НомерДоговора,
		|	СчетаДоверительногоУправления.ДатаЗаключения КАК ДатаЗаключения,
		|	РеквизитыКлиентаДУ.ИНН КАК ИНН,
		|	ДокументыЮридическихЛицСрезПоследних.Номер КАК ОГРН,
		|	РеквизитыКлиентаДУ.КодПоОКТМО КАК КодПоОКТМО,
		|	ВЫБОР
		|		КОГДА ЛицензииЮридическихЛицСрезПоследних.Статус = ЗНАЧЕНИЕ(Перечисление.СтатусыДокументов.Действует)
		|			ТОГДА ЛицензииЮридическихЛицСрезПоследних.Лицензия.Номер
		|	КОНЕЦ КАК НомерЛицензии,
		|	РеквизитыКлиентаДУ.СокращенноеНаименование КАК СокращенноеНаименованиеКлиента
		|ПОМЕСТИТЬ _ДанныеШапки
		|ИЗ
		|	Справочник.Организации КАК Организации
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|				&КонецПериода,
		|				Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|					И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыОрганизации
		|		ПО Организации.ЮрФизЛицо = РеквизитыОрганизации.ЮрФизЛицо,
		|	Справочник.СчетаДоверительногоУправления КАК СчетаДоверительногоУправления
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КлиентыДоверительногоУправления.СрезПоследних(&КонецПериода, ) КАК КлиентыДУ
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.РеквизитыЮридическихЛиц.СрезПоследних(
		|					&КонецПериода,
		|					Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)) КАК РеквизитыКлиентаДУ
		|			ПО КлиентыДУ.Клиент = РеквизитыКлиентаДУ.ЮрФизЛицо
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.СтатусыЛицензий.СрезПоследних(
		|					&КонецПериода,
		|					Лицензия.ВидДеятельности = ЗНАЧЕНИЕ(Справочник.ВидыДеятельности.НаОсуществлениеДеятельностиПоПенсионномуСтрахованию)) КАК ЛицензииЮридическихЛицСрезПоследних
		|			ПО КлиентыДУ.Клиент = ЛицензииЮридическихЛицСрезПоследних.Лицензия.ЮрФизЛицо
		|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДокументыЮридическихЛиц.СрезПоследних(
		|					&КонецПериода,
		|					Подразделение = ЗНАЧЕНИЕ(Справочник.Подразделения.ГруппаКомпаний)
		|						И Язык = ЗНАЧЕНИЕ(Справочник.Языки.Русский)
		|						И Вид = ЗНАЧЕНИЕ(Перечисление.ВидыДокументовЮридическихЛиц.СвидетельствоОГосударственнойРегистрации)) КАК ДокументыЮридическихЛицСрезПоследних
		|			ПО КлиентыДУ.Клиент = ДокументыЮридическихЛицСрезПоследних.ЮрФизЛицо
		|				И (ДокументыЮридическихЛицСрезПоследних.ДействуетПо = ДАТАВРЕМЯ(1, 1, 1)
		|					ИЛИ ДокументыЮридическихЛицСрезПоследних.ДействуетПо > &КонецПериода)
		|		ПО СчетаДоверительногоУправления.Ссылка = КлиентыДУ.СчетДоверительногоУправления
		|ГДЕ
		|	Организации.Ссылка = &Организация
		|	И СчетаДоверительногоУправления.Ссылка = &СчетДоверительногоУправления
		|;
		|
		|////////////////////////////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗРЕШЕННЫЕ
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет КАК Счет,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|			ТОГДА ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|		ИНАЧЕ ЗНАЧЕНИЕ(ВидСчета.Активный)
		|	КОНЕЦ КАК Вид,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Забалансовый КАК Забалансовый,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.ГлаваПланаСчетовНФО КАК ГлаваПланаСчетовНФО,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> &Валюта
		|			ТОГДА 0
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток / &ЕдиницаИзмерения
		|	КОНЕЦ * ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|			ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ВходящиеОстаткиВРублях,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> &Валюта
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток / &ЕдиницаИзмерения
		|		ИНАЧЕ 0
		|	КОНЕЦ * ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|			ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ВходящиеОстаткиВИнВалютеРублевомЭквиваленте,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток / &ЕдиницаИзмерения * ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|			ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ВходящиеОстаткиИтого,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток / &ЕдиницаИзмерения
		|		ИНАЧЕ 0
		|	КОНЕЦ * ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|			ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ВходящиеОстаткиОПС,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток / &ЕдиницаИзмерения
		|		ИНАЧЕ 0
		|	КОНЕЦ * ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|			ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ВходящиеОстаткиНПО,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаНачальныйОстаток / &ЕдиницаИзмерения
		|		ИНАЧЕ 0
		|	КОНЕЦ * ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|			ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ВходящиеОстаткиУД,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> &Валюта
		|			ТОГДА 0
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт / &ЕдиницаИзмерения
		|	КОНЕЦ КАК ОборотыПоДтВРублях,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> &Валюта
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт / &ЕдиницаИзмерения
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОборотыПоДтВИнВалютеРублевомЭквиваленте,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт / &ЕдиницаИзмерения КАК ОборотыПоДтИтого,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт / &ЕдиницаИзмерения
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОборотыПоДтОПС,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт / &ЕдиницаИзмерения
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОборотыПоДтНПО,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотДт / &ЕдиницаИзмерения
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОборотыПоДтУД,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> &Валюта
		|			ТОГДА 0
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт / &ЕдиницаИзмерения
		|	КОНЕЦ КАК ОборотыПоКтВРублях,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> &Валюта
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт / &ЕдиницаИзмерения
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОборотыПоКтВИнВалютеРублевомЭквиваленте,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт / &ЕдиницаИзмерения КАК ОборотыПоКтИтого,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт / &ЕдиницаИзмерения
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОборотыПоКтОПС,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт / &ЕдиницаИзмерения
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОборотыПоКтНПО,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаОборотКт / &ЕдиницаИзмерения
		|		ИНАЧЕ 0
		|	КОНЕЦ КАК ОборотыПоКтУД,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> &Валюта
		|			ТОГДА 0
		|		ИНАЧЕ ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток / &ЕдиницаИзмерения
		|	КОНЕЦ * ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|			ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ИсходящиеОстаткиВРублях,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Валютный
		|				И ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Валюта <> &Валюта
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток / &ЕдиницаИзмерения
		|		ИНАЧЕ 0
		|	КОНЕЦ * ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|			ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ИсходящиеОстаткиВИнВалютеРублевомЭквиваленте,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток / &ЕдиницаИзмерения * ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|			ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ИсходящиеОстаткиИтого,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиНакоплениями)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток / &ЕдиницаИзмерения
		|		ИНАЧЕ 0
		|	КОНЕЦ * ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|			ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ИсходящиеОстаткиОПС,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеПенсионнымиРезервами)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток / &ЕдиницаИзмерения
		|		ИНАЧЕ 0
		|	КОНЕЦ * ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|			ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ИсходящиеОстаткиНПО,
		|	ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СчетДоверительногоУправления.ВидДоговораДоверительногоУправления = ЗНАЧЕНИЕ(Перечисление.ВидыДоговоровДоверительногоУправления.УправлениеСобственнымиСредствамиПенсионныхФондов)
		|			ТОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.СуммаКонечныйОстаток / &ЕдиницаИзмерения
		|		ИНАЧЕ 0
		|	КОНЕЦ * ВЫБОР
		|		КОГДА ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Вид = ЗНАЧЕНИЕ(ВидСчета.Пассивный)
		|			ТОГДА -1
		|		ИНАЧЕ 1
		|	КОНЕЦ КАК ИсходящиеОстаткиУД,
		|	ЕдиныйБухгалтерскийУчетОстаткиИОбороты.Счет.Код КАК СчетКод
		|ПОМЕСТИТЬ _ТаблицаОтчета
		|ИЗ
		|	РегистрБухгалтерии.ЕдиныйБухгалтерскийУчет.ОстаткиИОбороты(&НачалоПериода, &КонецПериода, Период, , , , СчетДоверительногоУправления = &СчетДоверительногоУправления) КАК ЕдиныйБухгалтерскийУчетОстаткиИОбороты";
		
#КонецОбласти

#Область ВыводОтчёта

	ЕдиницаИзмерения = ?(ЕдиницаИзмерения = 0, 1, ЕдиницаИзмерения);

	Запрос.УстановитьПараметр("СчетДоверительногоУправления", СчетДоверительногоУправления);
	Запрос.УстановитьПараметр("Организация"					, Организация);
	Запрос.УстановитьПараметр("НачалоПериода"				, Период.ДатаНачала);
	Запрос.УстановитьПараметр("КонецПериода"				, Период.ДатаОкончания);
	Запрос.УстановитьПараметр("ЕдиницаИзмерения"			, ЕдиницаИзмерения);
	Запрос.УстановитьПараметр("Валюта"						, Организация.ВалютаУчета);
	
	Запрос.Выполнить();
	
	ДанныеШапки		= Запрос.МенеджерВременныхТаблиц.Таблицы["_ДанныеШапки"].ПолучитьДанные().Выгрузить();
	РеквизитыШапки = ДанныеШапки[0];
	ТаблицаОтчета	= Запрос.МенеджерВременныхТаблиц.Таблицы["_ТаблицаОтчета"].ПолучитьДанные().Выгрузить();
	ТаблицаОтчета.Сортировать("СчетКод");
	
	Макет = ПолучитьМакет("ОСВ");
	ОбластьЩапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьИмяФормы 	= Макет.ПолучитьОбласть("ИмяФормы");
	
	ОбластьЩапка.Параметры.Наименование = РеквизитыШапки.НаименованияУК + " / " + РеквизитыШапки.НомерДоговора + " от "  + Формат(РеквизитыШапки.ДатаЗаключения, "ДФ=dd.MM.yyyy") + " года";
	ОбластьЩапка.Параметры.НаименованиеНПФ = РеквизитыШапки.СокращенноеНаименованиеКлиента;
	ОбластьЩапка.Параметры.Период = ПредставлениеПериода(Период.ДатаНачала, Период.ДатаОкончания);
	ОбластьЩапка.Параметры.ЕдиницаИзмерения = ?(ЕдиницаИзмерения = 1000000, "млн.руб.", ?(ЕдиницаИзмерения = 1000, "тыс.руб.", "руб."));
	
	ЗаполнитьЗначенияСвойств(ОбластьЩапка.Параметры, РеквизитыШапки);   
	
	Если Период.ДатаОкончания < Дата(2026,1,1) Тогда  ///#743287
		ДокументРезультат.Вывести(ОбластьИмяФормы);
	КонецЕсли;
	ДокументРезультат.Вывести(ОбластьЩапка);
	
	ОбластьЗагловокПоЦентру	= Макет.ПолучитьОбласть("ЗагловокПоЦентру");
	
	
	// Балансовые счета, Активные
	ОбластьЗагловокПоЦентру.Параметры.Заголовок = "А. Балансовые счета";
	ДокументРезультат.Вывести(ОбластьЗагловокПоЦентру);
	
	ВывестиГруппу(ДокументРезультат, Макет, ТаблицаОтчета, Перечисления.ГлавыПланаСчетовНФО.ГлаваА, ВидСчета.Активный);
	ВывестиГруппу(ДокументРезультат, Макет, ТаблицаОтчета, Перечисления.ГлавыПланаСчетовНФО.ГлаваА, ВидСчета.Пассивный);
	
	
	ОбластьЗагловокПоЦентру.Параметры.Заголовок = "Б. Счета доверительного управления";
	ДокументРезультат.Вывести(ОбластьЗагловокПоЦентру);
	
	ВывестиГруппу(ДокументРезультат, Макет, ТаблицаОтчета, Перечисления.ГлавыПланаСчетовНФО.ГлаваБ, ВидСчета.Активный);
	ВывестиГруппу(ДокументРезультат, Макет, ТаблицаОтчета, Перечисления.ГлавыПланаСчетовНФО.ГлаваБ, ВидСчета.Пассивный);
	
	ОбластьЗагловокПоЦентру.Параметры.Заголовок = "В. Внебалансовые счета";
	ДокументРезультат.Вывести(ОбластьЗагловокПоЦентру);
	
	ВывестиГруппу(ДокументРезультат, Макет, ТаблицаОтчета, Перечисления.ГлавыПланаСчетовНФО.ГлаваВ, ВидСчета.Активный);
	ВывестиГруппу(ДокументРезультат, Макет, ТаблицаОтчета, Перечисления.ГлавыПланаСчетовНФО.ГлаваВ, ВидСчета.Пассивный);
	
	ОбластьЗагловокПоЦентру.Параметры.Заголовок = "Г. Счета по учету требований и обязательств по производным финансовым инструментам и прочим договорам (сделкам), по которым расчеты и поставка осуществляются не ранее следующего дня после дня заключения договора (сделки)";
	ДокументРезультат.Вывести(ОбластьЗагловокПоЦентру);
	
	ВывестиГруппу(ДокументРезультат, Макет, ТаблицаОтчета, Перечисления.ГлавыПланаСчетовНФО.ГлаваГ, ВидСчета.Активный);
	ВывестиГруппу(ДокументРезультат, Макет, ТаблицаОтчета, Перечисления.ГлавыПланаСчетовНФО.ГлаваГ, ВидСчета.Пассивный);
	
	Если ТаблицаОтчета.НайтиСтроки(Новый Структура("ГлаваПланаСчетовНФО", Перечисления.ГлавыПланаСчетовНФО.ПустаяСсылка())).Количество() > 0 Тогда
		ОбластьЗагловокПоЦентру	= Макет.ПолучитьОбласть("СчетаБезГлавыПланаСчетовНФО");
		ДокументРезультат.Вывести(ОбластьЗагловокПоЦентру);
		
		ВывестиГруппу(ДокументРезультат, Макет, ТаблицаОтчета, Перечисления.ГлавыПланаСчетовНФО.ПустаяСсылка(), ВидСчета.Активный);
		ВывестиГруппу(ДокументРезультат, Макет, ТаблицаОтчета, Перечисления.ГлавыПланаСчетовНФО.ПустаяСсылка(), ВидСчета.Пассивный);
	КонецЕсли;
	
	СтандартнаяОбработка = Ложь;
	
	СтруктураДанныхКонтактногоЛица = Неопределено;
	КомпоновщикНастроек.ПользовательскиеНастройки.ДополнительныеСвойства.Свойство("СтруктураДанныхКонтактногоЛица", СтруктураДанныхКонтактногоЛица);
	
	ПараметрыВыводаПодписей = Новый Структура;
	ПараметрыВыводаПодписей.Вставить("ИмяОбласти", "ПодписиБухгалтерскихОтчетовЕПС");
	ПараметрыВыводаПодписей.Вставить("ДатаФормирования", Формат(ТекущаяДата(), "ДФ='dd ММММ yyyy ""г.""'"));
	
	Если ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица) Тогда
	
		ПараметрыВыводаПодписей.Вставить("ФИОРуководителя", СтруктураДанныхКонтактногоЛица.КонтактноеЛицо);
		ОснованиеПолномочий = ?(ЗначениеЗаполнено(СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий), " (на основании " + СтруктураДанныхКонтактногоЛица.ОснованиеПолномочий + ")", "");
		ПараметрыВыводаПодписей.Вставить("ДолжностьРуководителя", СтруктураДанныхКонтактногоЛица.Должность + ОснованиеПолномочий);
	
	КонецЕсли; 
	
	РаботаСОтчетами.ВывестиПодписи(ДокументРезультат, ПараметрыВыводаПодписей);

	// Заполняем настройки печати	
	РаботаСОтчетами.ЗаполнитьНастройкиПечати(ДокументРезультат, ЭтотОбъект.Метаданные().ПолноеИмя());	
	
#КонецОбласти

	// Фиксируем завершение процедуры
	РегистрыСведений.СтатистикаРаботыВнутреннихМеханизмов.ЗарегистрироватьОкончаниеСессии(Механизм, Сессия);

КонецПроцедуры

Процедура ВывестиГруппу(ДокументРезультат, Макет, ТаблицаОтчета, ГлаваПланаСчетовНФО, Вид)
	
	ОбластьЗаголовокСлева	= Макет.ПолучитьОбласть("ЗаголовокСлева");
	ОбластьСтрока			= Макет.ПолучитьОбласть("Строка");
	ОбластьИтог				= Макет.ПолучитьОбласть("Итог");
	
	ОбластьЗаголовокСлева.Параметры.Заголовок = ?(Вид = ВидСчета.Активный, "Актив", "Пассив");
	ДокументРезультат.Вывести(ОбластьЗаголовокСлева);
	
	НайденныеСтроки = ТаблицаОтчета.НайтиСтроки(Новый Структура("ГлаваПланаСчетовНФО,Вид", ГлаваПланаСчетовНФО, Вид));
	
	Итоги = Новый Структура;
	Для Каждого Колонка Из ТаблицаОтчета.Колонки Цикл
		Если Колонка.Имя = "Счет" 
		ИЛИ Колонка.Имя = "Забалансовый" 
		ИЛИ Колонка.Имя = "ГлаваПланаСчетовНФО" 
		ИЛИ Колонка.Имя = "Вид" Тогда 
				Продолжить; 
		КонецЕсли;
			
		Итоги.Вставить(Колонка.Имя, 0);
	КонецЦикла;	
	
	Для Каждого СтрокаОтчета Из НайденныеСтроки Цикл
		ЗаполнитьЗначенияСвойств(ОбластьСтрока.Параметры, СтрокаОтчета);
		ДокументРезультат.Вывести(ОбластьСтрока);
		
		Для Каждого Итог Из Итоги Цикл
			Итоги[Итог.Ключ] = Итог.Значение + СтрокаОтчета[Итог.Ключ];
		КонецЦикла;
	КонецЦикла;
	
	ОбластьИтог.Параметры.Заголовок = ?(Вид = ВидСчета.Активный, "Итого по активу (баланс)", "Итого по пассиву (баланс)");
	
	ЗаполнитьЗначенияСвойств(ОбластьИтог.Параметры, Итоги);
	ДокументРезультат.Вывести(ОбластьИтог);
	
КонецПроцедуры

Функция ПолучитьДоступныеНастройки() Экспорт

	Настройки = Новый Массив;
	Настройки.Добавить("ВариантОпределенияНачальнойДаты");
	Настройки.Добавить("ЕдиницаИзмерения");
	Настройки.Добавить("Подписант");
	Настройки.Добавить("ПутьКФайлу");
	Настройки.Добавить("СрокПредоставления");
	Возврат Настройки;

КонецФункции
